Revit 2027 API
ParameterTypeId.TilePatternGridUnitX Property
 "Horizontal spacing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TilePatternGridUnitX { get; }
Public Shared ReadOnly Property TilePatternGridUnitX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TilePatternGridUnitX {
	ForgeTypeId^ get ();
}
static member TilePatternGridUnitX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace